---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetHubId
source: html/1f0de8b1-04fa-3513-a139-079cbb14853f.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetHubId Method

Id of associated Hub.

## Syntax (C#)
```csharp
public ElementId GetHubId()
```